demo-output/website/campaign/F5_runs/re3900/case/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}


application     pimpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         90.0;
deltaT          0.002;
adjustTimeStep  yes;
maxCo           1.5;
maxDeltaT       0.45;
writeControl    adjustableRunTime;
writeInterval   90.0;
purgeWrite      1;
writeFormat     ascii;
writePrecision  10;
timeFormat      general;
timePrecision   8;

functions
{
    forceCoeffs1
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   1;
        patches         (cylinder);
        rho             rhoInf;
        rhoInf          1.0;
        magUInf         1.0;
        lRef            1.0;
        Aref            0.1;
        CofR            (0 0 0);
        dragDir         (1 0 0);
        liftDir         (0 1 0);
        pitchAxis       (0 0 1);
    }
    yPlus1
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        executeControl  onEnd;
        writeControl    onEnd;
    }
    probesBase
    {
        type            probes;
        libs            (sampling);
        writeControl    timeStep;
        writeInterval   1;
        fields          (p);
        probeLocations
        (
        (0.505275 0 0.05)
        );
    }
    probesCenterline
    {
        type            probes;
        libs            (sampling);
        writeControl    timeStep;
        writeInterval   1;
        fields          (U);
        probeLocations
        (
        (0.55 0 0.05)
        (0.6 0 0.05)
        (0.65 0 0.05)
        (0.7 0 0.05)
        (0.75 0 0.05)
        (0.8 0 0.05)
        (0.85 0 0.05)
        (0.9 0 0.05)
        (0.95 0 0.05)
        (1 0 0.05)
        (1.05 0 0.05)
        (1.1 0 0.05)
        (1.15 0 0.05)
        (1.2 0 0.05)
        (1.25 0 0.05)
        (1.3 0 0.05)
        (1.35 0 0.05)
        (1.4 0 0.05)
        (1.45 0 0.05)
        (1.5 0 0.05)
        (1.55 0 0.05)
        (1.6 0 0.05)
        (1.65 0 0.05)
        (1.7 0 0.05)
        (1.75 0 0.05)
        (1.8 0 0.05)
        (1.85 0 0.05)
        (1.9 0 0.05)
        (1.95 0 0.05)
        (2 0 0.05)
        (2.05 0 0.05)
        (2.1 0 0.05)
        (2.15 0 0.05)
        (2.2 0 0.05)
        (2.25 0 0.05)
        (2.3 0 0.05)
        (2.35 0 0.05)
        (2.4 0 0.05)
        (2.45 0 0.05)
        (2.5 0 0.05)
        (2.55 0 0.05)
        (2.6 0 0.05)
        (2.65 0 0.05)
        (2.7 0 0.05)
        (2.75 0 0.05)
        (2.8 0 0.05)
        (2.85 0 0.05)
        (2.9 0 0.05)
        );
    }
}
